*** crates/nes-web/src/bridge.rs:11:9: replace BridgeCommand::tool_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ replace BridgeCommand::tool_name -> &'static str with "xyzzy"
@@ -3,21 +3,17 @@
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct BridgeCommand {
     pub core: Command,
 }

 impl BridgeCommand {
     #[must_use]
     pub fn tool_name(self) -> &'static str {
-        match self.core {
-            Command::PressButton(_) => "press_button",
-            Command::ReleaseButton(_) => "release_button",
-            _ => "unsupported",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
         "KeyZ" => Button::A,
         "KeyX" => Button::B,

---- dom_key_maps_to_press_button_command stdout ----

thread 'dom_key_maps_to_press_button_command' (31774) panicked at crates/nes-web/tests/web_bridge.rs:7:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "press_button"

---- release_button_command_maps_to_tool_name stdout ----

thread 'release_button_command_maps_to_tool_name' (31775) panicked at crates/nes-web/tests/web_bridge.rs:25:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "release_button"

failures:
    dom_key_maps_to_press_button_command
    release_button_command_maps_to_tool_name

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
