*** crates/nes-web/src/bridge.rs:12:13: delete match arm Command::PressButton(_) in BridgeCommand::tool_name

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm Command::PressButton(_) in BridgeCommand::tool_name
@@ -4,17 +4,17 @@
 pub struct BridgeCommand {
     pub core: Command,
 }

 impl BridgeCommand {
     #[must_use]
     pub fn tool_name(self) -> &'static str {
         match self.core {
-            Command::PressButton(_) => "press_button",
+             /* ~ changed by cargo-mutants ~ */
             Command::ReleaseButton(_) => "release_button",
             _ => "unsupported",
         }
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {

---- dom_key_maps_to_press_button_command stdout ----

thread 'dom_key_maps_to_press_button_command' (31901) panicked at crates/nes-web/tests/web_bridge.rs:7:5:
assertion `left == right` failed
  left: "unsupported"
 right: "press_button"

failures:
    dom_key_maps_to_press_button_command

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
