*** crates/nes-web/src/bridge.rs:13:13: delete match arm Command::ReleaseButton(_) in BridgeCommand::tool_name

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm Command::ReleaseButton(_) in BridgeCommand::tool_name
@@ -5,17 +5,17 @@
     pub core: Command,
 }

 impl BridgeCommand {
     #[must_use]
     pub fn tool_name(self) -> &'static str {
         match self.core {
             Command::PressButton(_) => "press_button",
-            Command::ReleaseButton(_) => "release_button",
+             /* ~ changed by cargo-mutants ~ */
             _ => "unsupported",
         }
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {

---- release_button_command_maps_to_tool_name stdout ----

thread 'release_button_command_maps_to_tool_name' (32029) panicked at crates/nes-web/tests/web_bridge.rs:25:5:
assertion `left == right` failed
  left: "unsupported"
 right: "release_button"

failures:
    release_button_command_maps_to_tool_name

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
