*** crates/nes-web/src/bridge.rs:21:5: replace map_dom_key_to_command -> Option<BridgeCommand> with None

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ replace map_dom_key_to_command -> Option<BridgeCommand> with None
@@ -13,28 +13,10 @@
             Command::ReleaseButton(_) => "release_button",
             _ => "unsupported",
         }
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
-    let button = match key_code {
-        "KeyZ" => Button::A,
-        "KeyX" => Button::B,
-        "Enter" => Button::Start,
-        "ShiftRight" => Button::Select,
-        "ArrowUp" => Button::Up,
-        "ArrowDown" => Button::Down,
-        "ArrowLeft" => Button::Left,
-        "ArrowRight" => Button::Right,
-        _ => return None,
-    };
-
-    let core = if pressed {
-        Command::PressButton(button)
-    } else {
-        Command::ReleaseButton(button)
-    };
-
-    Some(BridgeCommand { core })
+    None /* ~ changed by cargo-mutants ~ */
 }

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (32154) panicked at crates/nes-web/tests/web_bridge.rs:12:5:
assertion failed: map_dom_key_to_command("KeyZ", true).is_some()

---- dom_key_maps_to_press_button_command stdout ----

thread 'dom_key_maps_to_press_button_command' (32155) panicked at crates/nes-web/tests/web_bridge.rs:6:52:
called `Option::unwrap()` on a `None` value

---- release_button_command_maps_to_tool_name stdout ----

thread 'release_button_command_maps_to_tool_name' (32156) panicked at crates/nes-web/tests/web_bridge.rs:24:53:
called `Option::unwrap()` on a `None` value

failures:
    dom_key_maps_all_supported_keys
    dom_key_maps_to_press_button_command
    release_button_command_maps_to_tool_name
    runtime_dispatch_dom_key_updates_controller_state

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
