*** crates/nes-web/src/bridge.rs:22:9: delete match arm "KeyZ" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "KeyZ" in map_dom_key_to_command
@@ -14,17 +14,17 @@
             _ => "unsupported",
         }
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
-        "KeyZ" => Button::A,
+         /* ~ changed by cargo-mutants ~ */
         "KeyX" => Button::B,
         "Enter" => Button::Start,
         "ShiftRight" => Button::Select,
         "ArrowUp" => Button::Up,
         "ArrowDown" => Button::Down,
         "ArrowLeft" => Button::Left,
         "ArrowRight" => Button::Right,
         _ => return None,

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (32293) panicked at crates/nes-web/tests/web_bridge.rs:12:5:
assertion failed: map_dom_key_to_command("KeyZ", true).is_some()

---- release_button_command_maps_to_tool_name stdout ----

thread 'release_button_command_maps_to_tool_name' (32295) panicked at crates/nes-web/tests/web_bridge.rs:24:53:
called `Option::unwrap()` on a `None` value

failures:
    dom_key_maps_all_supported_keys
    release_button_command_maps_to_tool_name

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
