*** crates/nes-web/src/bridge.rs:23:9: delete match arm "KeyX" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "KeyX" in map_dom_key_to_command
@@ -15,17 +15,17 @@
         }
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
         "KeyZ" => Button::A,
-        "KeyX" => Button::B,
+         /* ~ changed by cargo-mutants ~ */
         "Enter" => Button::Start,
         "ShiftRight" => Button::Select,
         "ArrowUp" => Button::Up,
         "ArrowDown" => Button::Down,
         "ArrowLeft" => Button::Left,
         "ArrowRight" => Button::Right,
         _ => return None,
     };

---- dom_key_maps_to_press_button_command stdout ----

thread 'dom_key_maps_to_press_button_command' (32421) panicked at crates/nes-web/tests/web_bridge.rs:6:52:
called `Option::unwrap()` on a `None` value

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (32420) panicked at crates/nes-web/tests/web_bridge.rs:13:5:
assertion failed: map_dom_key_to_command("KeyX", true).is_some()

failures:
    dom_key_maps_all_supported_keys
    dom_key_maps_to_press_button_command

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
