*** crates/nes-web/src/bridge.rs:24:9: delete match arm "Enter" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "Enter" in map_dom_key_to_command
@@ -16,17 +16,17 @@
     }
 }

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
         "KeyZ" => Button::A,
         "KeyX" => Button::B,
-        "Enter" => Button::Start,
+         /* ~ changed by cargo-mutants ~ */
         "ShiftRight" => Button::Select,
         "ArrowUp" => Button::Up,
         "ArrowDown" => Button::Down,
         "ArrowLeft" => Button::Left,
         "ArrowRight" => Button::Right,
         _ => return None,
     };

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (32547) panicked at crates/nes-web/tests/web_bridge.rs:14:5:
assertion failed: map_dom_key_to_command("Enter", true).is_some()

failures:
    dom_key_maps_all_supported_keys

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
