*** crates/nes-web/src/bridge.rs:26:9: delete match arm "ArrowUp" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "ArrowUp" in map_dom_key_to_command
@@ -18,17 +18,17 @@

 #[must_use]
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
         "KeyZ" => Button::A,
         "KeyX" => Button::B,
         "Enter" => Button::Start,
         "ShiftRight" => Button::Select,
-        "ArrowUp" => Button::Up,
+         /* ~ changed by cargo-mutants ~ */
         "ArrowDown" => Button::Down,
         "ArrowLeft" => Button::Left,
         "ArrowRight" => Button::Right,
         _ => return None,
     };

     let core = if pressed {
         Command::PressButton(button)

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (32801) panicked at crates/nes-web/tests/web_bridge.rs:16:5:
assertion failed: map_dom_key_to_command("ArrowUp", true).is_some()

failures:
    dom_key_maps_all_supported_keys

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
