*** crates/nes-web/src/bridge.rs:28:9: delete match arm "ArrowLeft" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "ArrowLeft" in map_dom_key_to_command
@@ -20,17 +20,17 @@
 pub fn map_dom_key_to_command(key_code: &str, pressed: bool) -> Option<BridgeCommand> {
     let button = match key_code {
         "KeyZ" => Button::A,
         "KeyX" => Button::B,
         "Enter" => Button::Start,
         "ShiftRight" => Button::Select,
         "ArrowUp" => Button::Up,
         "ArrowDown" => Button::Down,
-        "ArrowLeft" => Button::Left,
+         /* ~ changed by cargo-mutants ~ */
         "ArrowRight" => Button::Right,
         _ => return None,
     };

     let core = if pressed {
         Command::PressButton(button)
     } else {
         Command::ReleaseButton(button)

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (33055) panicked at crates/nes-web/tests/web_bridge.rs:18:5:
assertion failed: map_dom_key_to_command("ArrowLeft", true).is_some()

failures:
    dom_key_maps_all_supported_keys

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
