*** crates/nes-web/src/bridge.rs:29:9: delete match arm "ArrowRight" in map_dom_key_to_command

*** mutation diff:
--- crates/nes-web/src/bridge.rs
+++ delete match arm "ArrowRight" in map_dom_key_to_command
@@ -21,17 +21,17 @@
     let button = match key_code {
         "KeyZ" => Button::A,
         "KeyX" => Button::B,
         "Enter" => Button::Start,
         "ShiftRight" => Button::Select,
         "ArrowUp" => Button::Up,
         "ArrowDown" => Button::Down,
         "ArrowLeft" => Button::Left,
-        "ArrowRight" => Button::Right,
+         /* ~ changed by cargo-mutants ~ */
         _ => return None,
     };

     let core = if pressed {
         Command::PressButton(button)
     } else {
         Command::ReleaseButton(button)
     };

---- dom_key_maps_all_supported_keys stdout ----

thread 'dom_key_maps_all_supported_keys' (33182) panicked at crates/nes-web/tests/web_bridge.rs:19:5:
assertion failed: map_dom_key_to_command("ArrowRight", true).is_some()

---- runtime_dispatch_dom_key_updates_controller_state stdout ----

thread 'runtime_dispatch_dom_key_updates_controller_state' (33185) panicked at crates/nes-web/tests/web_bridge.rs:57:5:
assertion failed: mapped

failures:
    dom_key_maps_all_supported_keys
    runtime_dispatch_dom_key_updates_controller_state

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
